app/Http/Controllers/Admin/Common/Certifications.php

    public function index()
    {
        // $data['rightButton']['iconClass'] = 'fa fa-plus';
        // $data['rightButton']['text']      = 'Add certification';
        // $data['rightButton']['link']      = 'certification/add_certification';
        // $data['certification']                  = Certification::orderBy('id', 'desc')
        //     ->paginate(config('constant.smPagination'));
        // if (\request()->ajax()) {
        //     $json['data']         = view('sm-admin/common/certification/certification_list', $data)->render();
        //     $json['smPagination'] = view('sm-admin/common/common/pagination_links', [
        //         'smPagination' => $data['certification']
        //     ])->render();

        //     return response()->json($json);
        // }
        // dd($data);
        $data = Certification::orderBy('id','DESC')->get();
---
select * from `certifications` order by `id` desc

    public function edit($id)
    {
        $certification = Certification::where('id',$id)->get();
---
select * from `certifications` where `id` = '3'