app/Http/Controllers/Admin/Common/Dashboard.php

select * from `visitors` order by `id` desc limit 50
select * from `visitors` where `date` = '2024-07-25' limit 1
select max(`views`) as aggregate from `visitors`
---
	public function index() {
		$data['views']            = Visitor::orderBy( 'id', 'desc' )
		                                   ->take( '50' )
		                                   ->get()
		                                   ->reverse();
		$data['viewsReformatted'] = [];
		$data['viewsInfo']        = [];
		if ( isset( $data['views'] ) && count( $data['views'] ) > 0 ) {
			$loop = 0;
			foreach ( $data['views'] as $view ) {
				$data['viewsReformatted'][ $loop ][] = $loop;
				$data['viewsReformatted'][ $loop ][] = $view->views;
				$data['viewsInfo'][ $loop ]          = $view->views . ( $view->views > 1 ? " views on " : " view on " ) . date( 'dS F, Y', strtotime( $view->date ) );
				$loop ++;
			}
		}
		$date                  = date( 'Y-m-d' );
		$visitor               = Visitor::where( 'date', '=', $date )->first();
		$data['today_visitor'] = $visitor ? (int) $visitor->views : 0;
		$data['max_visitor']   = (int) Visitor::max( 'views' );