app/Http/Controllers/Admin/Common/Sliders.php

	function sliders()
	{
		$data['rightButton']['iconClass'] = 'fa fa-plus';
		$data['rightButton']['text']      = 'Add Slider';
		$data['rightButton']['link']      = 'sliders/add_slider';
		$data['sliders']                  = Slider::orderBy('id', 'desc')
			->paginate(config('constant.smPagination'));
---
select * from `sliders` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `sliders`

	function edit_slider($id)
	{
		$data['rightButton']['iconClass'] = 'fa fa-sliders';
		$data['rightButton']['text']      = 'Slider List';
		$data['rightButton']['link']      = 'sliders';
		$data['slider']                   = Slider::find($id);
---
select * from `sliders` where `sliders`.`id` = '3' limit 1