app/Http/Controllers/Front/FrontEnd.php

    public function new_home_page()
    {
        $data = $this->homePageData();
        $query = Products_model::orderBy('products.id', 'desc');
        $data['products'] = $query->paginate(config('constant.smPagination'));
        $data["categories"] = Category_model::where("category_type", 1)->where("parent_id", 0)
            ->orderBy("id", "desc")
            ->paginate(4);
---
select * from `products` order by `products`.`id` desc limit 10 offset 0
select count(*) as aggregate from `products`
select * from `categories` where `category_type` = '1' and `parent_id` = '0' order by `id` desc limit 4 offset 0
select count(*) as aggregate from `categories` where `category_type` = '1' and `parent_id` = '0'

    public function homePageData()
    {
        $data['s_info'] = S_model::all();
        $data["sliders"] = Slider::orderBy("id", "desc")->where("status", 1)->get();
        $data["categories"] = Category::all();
        $data["categoryables"] = DB::table('categoryables')
            ->join('categories', 'categoryables.category_id', '=', 'categories.id')
            ->groupBy('category_id')
            ->where('categoryable_type', 'App\Model\Common\Portfolio')
            ->get();

        $data["portfolios_data"] = Portfolio::orderBy('sortby', 'ASC')->take(12)->get();

        // $data["portfolios_data"]  = DB::table('portfolios')
        //                     ->leftJoin('categoryables', 'categoryables.categoryable_id', '=', 'portfolios.id')
        //                     ->select('portfolios.*', 'categoryables.category_id')
        //                     // ->groupBy('categoryable_id')
        //                     ->latest()
        //                     ->get();
        // dd( $data["portfolios_data"]);
        $data["blogs"] = SM::getCache('homeBlogs', function () {
            $blog_show = SM::smGetThemeOption("blog_show", 6);

            return Blog::with("user")
                ->where("status", 1)
                ->orderBy("id", "desc")
                ->limit($blog_show)
                ->get();
---
select * from `sliders` where `status` = '1' order by `id` desc
select * from `categories`
select * from `categoryables` inner join `categories` on `categoryables`.`category_id` = `categories`.`id` where `categoryable_type` = 'App\Model\Common\Portfolio' group by `category_id`
select * from `portfolios` order by `sortby` asc limit 12
select * from `blogs` where `status` = '1' order by `id` desc limit 6

        $data['packages'] = SM::getCache($key, function () {
            $package_posts_per_page = SM::smGetThemeOption("package_posts_per_page", 12);

            return Package::with('detail')
                ->where("status", 1)
                ->orderBy('id', 'desc')
                ->paginate($package_posts_per_page);
---
select * from `packages` where `status` = '1' order by `id` desc limit 2 offset 0
select count(*) as aggregate from `packages` where `status` = '1'

    public function product()
    {

        $data['categorys'] = Category::where('category_type', 1)->orderBy("id", "desc")->paginate(10);
        $query = Products::orderBy('products.id', 'desc');
        $data['products'] = $query->paginate(config('constant.smPagination'));
---
select * from `categories` where `category_type` = '1' order by `id` desc limit 10 offset 0
select count(*) as aggregate from `categories` where `category_type` = '1'
select * from `products` order by `products`.`id` desc limit 10 offset 0
select count(*) as aggregate from `products`

    public function productview($slug = NULL)
    {
        if ($slug) {
            $categoryInfo = Category::with('products', 'subcategories')->where("slug", $slug)->first();
            if ($categoryInfo != NULL) {
                $category_id = $categoryInfo->id;
                $data['categoryInfo'] = $categoryInfo;
                $data['categorys'] = Category::with('subcategories')->where('parent_id', 0)->where('category_type', 1)->orderBy("id", "desc")->paginate(10);
---
select * from `categories` where `slug` = 'other-auxiliaries' limit 1
select * from `products` where `products`.`category_id` in ('32')
select * from `categories` where `parent_id` = '0' and `category_type` = '1' order by `id` desc limit 10 offset 0
select count(*) as aggregate from `categories` where `parent_id` = '0' and `category_type` = '1'

    public function tag($slug)
    {
        $data["tagInfo"] = SM::getCache('tag_' . $slug, function () use ($slug) {
            return Tag::with("blogs")
                ->where("slug", $slug)
                ->where('status', 1)
                ->first();
        });
---
select * from `tags` where `slug` = 'seo-company-in-bangladesh' and `status` = '1' limit 1

    function page($url)
    {
        $data['page'] = SM::getCache('page_' . $url, function () use ($url) {
            return Page_model::where('slug', $url)->where('status', 1)->first();
        });
---
select * from `pages` where `slug` = 'academy.webp' and `status` = '1' limit 1