app/SM/SM_Admin.php

	public static function current_user_permission_array()
	{
		if (static::$currentUserPermissionResult) {
			$result = static::$currentUserPermissionResult;
		} else {
			//			Debugbar::info( "current_user_permission_array else " );
			$result = static::$currentUserPermissionResult = Role::find(self::current_user_role());
---
select * from `roles` where `roles`.`id` = '1' limit 1