app/SM/SM_Front.php

	public static function initSettingAutoLoad() {
		$settings_autoload = Cache::rememberForever( "setting_autoload", function () {
			return Setting::where( 'autoload', 1 )->get();
---
select * from `settings` where `autoload` = '1'

	public static function sm_daily_visit() {
		$date = date( 'Y-m-d' );
		if ( ! ( Session::has( 'views' ) && session( 'views' ) == $date ) || ! Session::has( 'views' ) ) {
			$date = date( 'Y-m-d' );
//      $date = '2016-06-25';
			$visitor = Visitor::where( 'date', $date )->first();
			if ( $visitor ) {
				$visitor->increment( 'views' );
			} else {
				$visitor        = new Visitor();
				$visitor->date  = $date;
				$visitor->views = 1;
				$visitor->save();
---
select * from `visitors` where `date` = '2023-10-02' limit 1
update `visitors` set `views` = `views` + 1 where `id` = '1690'
insert into `visitors` (`date`, `views`) values ('2023-10-02', '1')

	public static function getPopularBlog( $noOfPost = 5 ) {
		return SM::getCache( 'sidebar_popular_blog', function () use ( $noOfPost ) {
			return Blog::where( "status", 1 )
			           ->orderBy( "views", "desc" )
			           ->limit( $noOfPost )
			           ->get();
---
select * from `blogs` where `status` = '1' order by `views` desc limit 3

	public static function getCategories( $isWithHaveNoPost = 1 ) {
		if ( $isWithHaveNoPost == 1 ) {
			return SM::getCache( 'categories_have_not_post', function () {
				return Category::all();
---
select * from `categories`

	public static function getTags( $isWithHaveNoPost = 1 ) {
		if ( $isWithHaveNoPost == 0 ) {
			return SM::getCache( 'tags_have_posts', function () {
				return Tag::where( "total_posts", ">", 0 )
				          ->get();
			} );
		} else {
			return SM::getCache( 'tags_have_not_post', function () {
				return Tag::all();
---
select * from `tags`

	public static function subscribe( $infos ) {
		$subscriber = Subscriber::where( "email", $infos->email )->first();
		if ( $subscriber ) {
			foreach ( $infos as $key => $value ) {
				$subscriber->$key = $value;
			}
			$subscriber->update();
			if ( $subscriber->status == 1 ) {
				return "You already Subscribed our newsletter. <br>Thanks";
			} else {
				return SM::smGetThemeOption(
					"newsletter_form_success_message", "Congratulations! Doodle has been successfully activated and now you will get latest update"
				);
			}
		} else {
			$subscriber = new Subscriber();
			foreach ( $infos as $key => $value ) {
				$subscriber->$key = $value;
			}
			$subscriber->save();
---
select * from `subscribers` where `email` = 'JaINaM.GANdHi@krestONGtA.coM' limit 1
insert into `subscribers` (`email`, `ip`, `city`, `state`, `country`, `updated_at`, `created_at`) values ('JaINaM.GANdHi@krestONGtA.coM', '90.220.185.23', '', '', '', '2023-08-23 04:34:57', '2023-08-23 04:34:57')